[
  {
    "name": "The Crown and Rose",
    "location": "Kensington",
    "address": "123 King's Road",
    "type": "pub",
    "cuisine": "british",
    "price": 2,
    "phone": "+44123456789",
    "suggestedFood": ["Fish and Chips", "Bangers and Mash", "Shepherd's Pie"],
    "photo": "crownandrose",
    "shortDesc": "Traditional pub serving classic British dishes in a cozy atmosphere.",
    "tip": "This restaurant is small and has an 8-person capacity, so please be mindful of the size of your dog before bringing them!",
    "desc": "The Crown and Rose is a charming British pub located in the heart of Kensington. Indulge in traditional dishes like fish and chips, bangers and mash, and shepherd's pie while enjoying the warm and friendly ambiance. Bring your furry friend along, but remember that the pub has limited seating, so plan accordingly."
  },
  {
    "name": "Red Lantern",
    "location": "Soho",
    "address": "123 Wardour Street",
    "type": "restaurant",
    "cuisine": "chinese",
    "price": 2,
    "phone": "+441234567890",
    "suggestedFood": ["Sweet and Sour Chicken", "Kung Pao Shrimp", "Peking Duck"],
    "photo": "redlantern",
    "shortDesc": "Authentic Chinese restaurant offering a wide selection of classic dishes.",
    "tip": "This restaurant has a dog-friendly policy. Dogs are welcome in the outdoor seating area.",
    "desc": "Indulge in the flavors of China at Red Lantern, an authentic Chinese restaurant located in the vibrant neighborhood of Soho. From mouthwatering sweet and sour chicken to flavorful Kung Pao shrimp and succulent Peking duck, their menu offers a wide selection of classic dishes. Enjoy the delightful outdoor seating area with your furry friend, as this restaurant has a dog-friendly policy."
  },
  {
    "name": "Bella's Bistro",
    "location": "Covent Garden",
    "address": "789 Floral Street",
    "type": "restaurant",
    "cuisine": "italian",
    "price": 2,
    "phone": "+447890123456",
    "suggestedFood": ["Margherita Pizza", "Pasta Carbonara", "Tiramisu"],
    "photo": "bellasitalian",
    "shortDesc": "Charming Italian bistro serving authentic dishes made with fresh ingredients.",
    "tip": "This restaurant welcomes dogs of all sizes. They provide water bowls and treats for your furry friend!",
    "desc": "Discover the flavors of Italy at Bella's Bistro, a charming restaurant nestled in the heart of Covent Garden. Indulge in authentic dishes like margherita pizza, pasta carbonara, and tiramisu, all made with the freshest ingredients. Bring your four-legged companion along, as the bistro offers a warm welcome to dogs and even provides water bowls and treats."
  },
  {
    "name": "The Hungry Haddock",
    "location": "Whitechapel",
    "address": "321 Commercial Road",
    "type": "restaurant",
    "cuisine": "seafood",
    "price": 2,
    "phone": "07890123456",
    "suggestedFood": ["Grilled Salmon", "Fisherman's Pie", "Seafood Paella"],
    "photo": "hungryhaddock",
    "shortDesc": "Cozy seafood restaurant offering a delightful selection of fresh catches.",
    "tip": "This restaurant has an outdoor seating area where your dog can relax while you enjoy your meal.",
    "desc": "Nestled in Whitechapel, The Hungry Haddock is a cozy seafood restaurant that promises to delight seafood enthusiasts. Savor a variety of dishes, including grilled salmon, fisherman's pie, and seafood paella, all prepared with the freshest catches. With an outdoor seating area, this establishment provides a perfect spot for you and your furry companion to enjoy a meal together."
  },
  {
    "name": "Café Britannia",
    "location": "Westminster",
    "address": "987 Parliament Square",
    "type": "cafe",
    "cuisine": "british",
    "price": 1,
    "phone": "+441234567890",
    "suggestedFood": ["Full English Breakfast", "Roast Beef Sandwich", "Victoria Sponge Cake"],
    "photo": "cafebritannia",
    "shortDesc": "Quaint café serving British favorites like breakfast, sandwiches, and desserts.",
    "tip": "This café is dog-friendly both indoors and outdoors. They have a special dog menu too!",
    "desc": "Located in Westminster, Café Britannia is a quaint café that offers a taste of traditional British cuisine. Start your day with a satisfying full English breakfast or enjoy a delicious roast beef sandwich for lunch. Don't forget to treat yourself to a slice of Victoria sponge cake. Plus, your furry friend is welcome both indoors and outdoors, and they even have a special dog menu available."
  },
  {
    "name": "Sushi Union",
    "location": "Islington",
    "address": "654 Upper Street",
    "type": "restaurant",
    "cuisine": "japanese",
    "price": 2,
    "phone": "07901234567",
    "suggestedFood": ["Sashimi Platter", "Chicken Teriyaki", "Miso Soup"],
    "photo": "sushiunion",
    "shortDesc": "Authentic Japanese restaurant specializing in sushi, teriyaki, and traditional dishes.",
    "tip": "This restaurant has a spacious outdoor seating area, perfect for you and your dog to enjoy a meal together.",
    "desc": "Indulge in the authentic flavors of Japan at Sushi Union, a renowned Japanese restaurant nestled in Islington. From a delightful sashimi platter to mouthwatering chicken teriyaki, their menu offers a wide range of traditional dishes. Take advantage of the spacious outdoor seating area, allowing you and your furry companion to relax and savor the culinary delights of Japan."
  },
  {
    "name": "La Patisserie Royale",
    "location": "Mayfair",
    "address": "234 Park Lane",
    "type": "cafe",
    "cuisine": "french",
    "price": 1,
    "phone": "+447890123456",
    "suggestedFood": ["Croissant", "Quiche Lorraine", "Crème Brûlée"],
    "photo": "patisserieroyale",
    "shortDesc": "Charming café offering delectable French pastries, quiches, and desserts.",
    "tip": "This café has limited outdoor seating, so it's recommended to visit during less busy hours with your dog.",
    "desc": "Transport yourself to the streets of Paris at La Patisserie Royale, a charming café located in Mayfair. Indulge in delectable French pastries, quiches, and desserts like croissants, quiche Lorraine, and crème brûlée. While the café is dog-friendly, it's advisable to visit during less busy hours due to limited outdoor seating."
  },
  {
    "name": "The Rustic Inn",
    "location": "Shoreditch",
    "address": "432 Brick Lane",
    "type": "bar",
    "cuisine": "british",
    "price": 1,
    "phone": "07901234567",
    "suggestedFood": ["Classic Burger", "Beer-Battered Onion Rings", "BBQ Chicken Wings"],
    "photo": "rusticinn",
    "shortDesc": "Lively bar serving delicious pub food favorites with a rustic twist.",
    "tip": "This bar welcomes well-behaved dogs. However, please note that they don't allow dogs inside the premises.",
    "desc": "The Rustic Inn is a lively bar located in Shoreditch that offers a delightful selection of pub food favorites. Indulge in classic burgers, beer-battered onion rings, and BBQ chicken wings, all with a rustic twist. While well-behaved dogs are welcome in the outdoor seating area, please note that dogs are not allowed inside the premises."
  },
  {
    "name": "Fusion Fare",
    "location": "Brixton",
    "address": "876 Electric Avenue",
    "type": "restaurant",
    "cuisine": "mixed",
    "price": 2,
    "phone": "+441234567890",
    "suggestedFood": ["Beef Stir-Fry", "Mediterranean Salad", "Chicken Satay"],
    "photo": "fusionfare",
    "shortDesc": "Eclectic restaurant offering a fusion of flavors from around the world.",
    "tip": "This restaurant has a dog-friendly outdoor seating area with water bowls available.",
    "desc": "Embark on a culinary journey around the world at Fusion Fare, an eclectic restaurant located in Brixton. Experience a fusion of flavors with dishes like beef stir-fry, Mediterranean salad, and chicken satay. Enjoy the vibrant outdoor seating area with your four-legged companion, where water bowls are provided for their comfort."
  },
  {
    "name": "The Secret Garden",
    "location": "Notting Hill",
    "address": "567 Portobello Road",
    "type": "restaurant",
    "cuisine": "vegetarian",
    "price": 2,
    "phone": "07890123456",
    "suggestedFood": ["Roasted Vegetable Tart", "Mushroom Risotto", "Vegan Chocolate Cake"],
    "photo": "secretgarden",
    "shortDesc": "Quaint restaurant serving creative vegetarian dishes in a charming garden setting.",
    "tip": "This restaurant welcomes dogs in their outdoor seating area, which offers a lovely garden atmosphere.",
    "desc": "Nestled in the picturesque streets of Notting Hill, The Secret Garden is a quaint restaurant offering creative vegetarian dishes. From roasted vegetable tart to mushroom risotto and vegan chocolate cake, their menu is sure to please even the most discerning palate. Enjoy the delightful garden atmosphere with your furry friend, as dogs are welcome in the outdoor seating area."
  },
  {
    "name": "The Flaming Skillet",
    "location": "Camden",
    "address": "210 Camden High Street",
    "type": "restaurant",
    "cuisine": "american",
    "price": 2,
    "phone": "+447890123456",
    "suggestedFood": ["BBQ Ribs", "Classic Cheeseburger", "Sweet Potato Fries"],
    "photo": "flamingskillet",
    "shortDesc": "American-style restaurant with a fiery twist, serving BBQ, burgers, and more.",
    "tip": "This restaurant has outdoor seating available for you and your dog. Enjoy the flavorful dishes together!",
    "desc": "Get ready to savor the bold flavors of American cuisine at The Flaming Skillet, a vibrant restaurant located in Camden. From succulent BBQ ribs to classic cheeseburgers and crispy sweet potato fries, their menu is a haven for burger enthusiasts. The restaurant offers outdoor seating, providing the perfect spot for you and your dog to enjoy a meal together."
  },
  {
    "name": "Thai Orchid",
    "location": "Sukhumvit",
    "address": "555 Oxford Street",
    "type": "restaurant",
    "cuisine": "thai",
    "price": 2,
    "phone": "07901234567",
    "suggestedFood": ["Green Curry", "Pad See Ew", "Mango Sticky Rice"],
    "photo": "thaiorchid",
    "shortDesc": "Authentic Thai restaurant offering a delightful array of traditional dishes.",
    "tip": "This restaurant has outdoor seating available, providing a pleasant dining experience for you and your dog.",
    "desc": "Experience the vibrant flavors of Thailand at Thai Orchid, an authentic restaurant located in Sukhumvit. From aromatic green curry to savory pad see ew and indulgent mango sticky rice, their menu showcases a delightful array of traditional Thai dishes. With outdoor seating available, this restaurant ensures a pleasant dining experience for both you and your furry friend."
  },
  {
    "name": "Bella Napoli",
    "location": "Greenwich",
    "address": "321 Greenwich Avenue",
    "type": "restaurant",
    "cuisine": "italian",
    "price": 2,
    "phone": "+441234567890",
    "suggestedFood": ["Caprese Salad", "Lasagna", "Panna Cotta"],
    "photo": "bellanapoli",
    "shortDesc": "Cosy Italian restaurant serving classic dishes with a touch of Napoli.",
    "tip": "This restaurant has a dog-friendly policy and provides water bowls and treats for furry guests.",
    "desc": "Transport yourself to the heart of Naples at Bella Napoli, a cozy Italian restaurant located in Greenwich. Indulge in classic dishes with a touch of Napoli, such as Caprese salad, lasagna, and panna cotta. With a dog-friendly policy, this restaurant warmly welcomes furry guests and even provides water bowls and treats."
  },
  {
    "name": "The Wholesome Platter",
    "location": "Hampstead",
    "address": "999 Hampstead Lane",
    "type": "restaurant",
    "cuisine": "vegetarian",
    "price": 2,
    "phone": "07890123456",
    "suggestedFood": ["Quinoa Bowl", "Avocado Toast", "Acai Bowl"],
    "photo": "wholesomeplatter",
    "shortDesc": "Healthy restaurant offering a variety of nourishing and delicious dishes.",
    "tip": "This restaurant welcomes dogs both indoors and outdoors. They have a dog-friendly seating area.",
    "desc": "Discover a haven of healthy delights at The Wholesome Platter, a restaurant located in Hampstead. Their menu features a variety of nourishing and delicious dishes, including quinoa bowls, avocado toast, and refreshing acai bowls. Whether you choose to dine indoors or outdoors, this restaurant offers a dog-friendly seating area, ensuring a pleasant experience for both you and your furry friend."
  },
  {
    "name": "Green Leaf Cafe",
    "location": "Richmond",
    "address": "456 Richmond Road",
    "type": "cafe",
    "cuisine": "vegetarian",
    "price": 1,
    "phone": "+447890123456",
    "suggestedFood": ["Spinach and Feta Quiche", "Falafel Wrap", "Chia Pudding"],
    "photo": "greenleafcafe",
    "shortDesc": "Cozy café serving a range of vegetarian delights in a leafy setting.",
    "tip": "This café has a dog-friendly outdoor seating area where your furry friend can relax while you enjoy your meal.",
    "desc": "Escape to Green Leaf Cafe, a cozy café nestled in Richmond, where vegetarian delights await. From savory spinach and feta quiche to flavorful falafel wraps and wholesome chia pudding, their menu caters to all taste preferences. Relax in the leafy outdoor seating area, which welcomes dogs and provides a pleasant ambiance for you and your furry friend."
  },
  {
    "name": "The Burger Den",
    "location": "Brixton",
    "address": "222 Coldharbour Lane",
    "type": "restaurant",
    "cuisine": "american",
    "price": 1,
    "phone": "07901234567",
    "suggestedFood": ["Cheeseburger", "Chicken Burger", "Sweet Potato Fries"],
    "photo": "burgerden",
    "shortDesc": "Bustling burger joint offering delicious burgers and tasty sides.",
    "tip": "This restaurant has outdoor seating available, making it a great spot to bring your dog along.",
    "desc": "Craving a juicy burger? Look no further than The Burger Den, a bustling restaurant located in Brixton. With a mouthwatering selection of burgers, including classic cheeseburgers and flavorful chicken burgers, accompanied by delectable sides like sweet potato fries, this joint is a haven for burger enthusiasts. The restaurant offers outdoor seating, providing the perfect spot for you and your dog to enjoy a meal together."
  },
  {
    "name": "Oceanic Eats",
    "location": "Chelsea",
    "address": "789 King's Road",
    "type": "restaurant",
    "cuisine": "seafood",
    "price": 3,
    "phone": "+441234567890",
    "suggestedFood": ["Lobster Bisque", "Grilled Sea Bass", "Crab Linguine"],
    "photo": "oceaniceats",
    "shortDesc": "Upscale seafood restaurant offering exquisite dishes with a touch of the ocean.",
    "tip": "This restaurant has a limited outdoor seating area, so it's recommended to make a reservation, especially if you're bringing your dog.",
    "desc": "Indulge in a culinary journey of the ocean at Oceanic Eats, an upscale seafood restaurant located in Chelsea. Discover exquisite dishes such as lobster bisque, grilled sea bass, and flavorful crab linguine, all prepared with a touch of finesse. While the restaurant provides a limited outdoor seating area, it's advisable to make a reservation, especially if you plan to bring your dog."
  },
  {
    "name": "Le Petit Bistro",
    "location": "Notting Hill",
    "address": "111 Westbourne Grove",
    "type": "restaurant",
    "cuisine": "french",
    "price": 2,
    "phone": "07890123456",
    "suggestedFood": ["Escargots", "Coq au Vin", "Crème Caramel"],
    "photo": "petitbistro",
    "shortDesc": "Intimate bistro serving classic French dishes in a charming ambiance.",
    "tip": "This bistro has outdoor seating available, creating a relaxed atmosphere for you and your dog.",
    "desc": "Experience the essence of French cuisine at Le Petit Bistro, an intimate restaurant located in Notting Hill. Indulge in classic dishes such as escargots, coq au vin, and heavenly crème caramel, all prepared with exquisite attention to detail. With outdoor seating available, this charming bistro offers a relaxed ambiance for you and your furry companion to enjoy a memorable meal together."
  },
  {
    "name": "Tandoori Temptations",
    "location": "Brick Lane",
    "address": "567 Brick Lane",
    "type": "restaurant",
    "cuisine": "indian",
    "price": 2,
    "phone": "+447890123456",
    "suggestedFood": ["Chicken Tikka Masala", "Lamb Biryani", "Garlic Naan"],
    "photo": "tandooritemptations",
    "shortDesc": "Authentic Indian restaurant offering a tantalizing selection of flavorful dishes.",
    "tip": "This restaurant has outdoor seating available, providing a pleasant dining experience for you and your dog.",
    "desc": "Embark on a flavorful journey through the spices of India at Tandoori Temptations, an authentic restaurant situated in Brick Lane. Sample a tantalizing selection of dishes, including the all-time favorite chicken tikka masala, aromatic lamb biryani, and fragrant garlic naan. With outdoor seating available, this restaurant ensures a delightful dining experience for both you and your furry friend."
  },
  {
    "name": "Heavenly Delights",
    "location": "Southbank",
    "address": "876 Southbank Place",
    "type": "restaurant",
    "cuisine": "desserts",
    "price": 1,
    "phone": "07901234567",
    "suggestedFood": ["Chocolate Lava Cake", "New York Cheesecake", "Caramel Pudding"],
    "photo": "heavnelydelights",
    "shortDesc": "Indulge in heavenly desserts crafted with love and the finest ingredients.",
    "tip": "This dessert restaurant has outdoor seating, so you can enjoy your sweet treats with your furry companion.",
    "desc": "Satisfy your sweet tooth at Heavenly Delights, a dessert restaurant located in Southbank. Indulge in heavenly creations like chocolate lava cake, New York cheesecake, and luscious caramel pudding, all crafted with love and the finest ingredients. With outdoor seating available, you can relax and enjoy your sweet treats in the company of your furry companion."
  }
]
 
